In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
!cp "/content/drive/MyDrive/Colab Notebooks/PDS/train.csv" "./data.csv"

In [4]:
df = pd.read_csv('./data.csv')

print("Original DataFrame:")
print(df)
print("\n" + "="*50 + "\n")

Original DataFrame:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
0                 41000    Diesel       Manual      First  19.67 kmpl
1                 46000    Petrol       Manual      First    13 km/kg
2                 87000    Diesel       Manual      First  20.77 kmpl
3                 40670    Diesel    Automatic     Second   15.2 kmpl
4                 86999    Diesel       Manual      First  23.08 kmpl
...                 ...       ...          ...        ...         ...
5842              27365    Diesel       Manual      First   28.4 kmpl
5843             100000    Diesel       Manual      First   24.4 kmpl
5844              55000    Diesel       Manual     Second   14.0 kmpl
5845              46000    Petrol       Manual      First   18.9 kmpl
5846              47000    Diesel       Manual      First  25.44 kmpl

       Engine      Power  Seats  New_Price  Price
0     1582 CC  126.2 bhp    5.0        NaN  12.50
1     1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
2     1248 CC  88.76 bhp    7.0        NaN   6.00
3     1968 CC  140.8 bhp    5.0        NaN  17.74
4     1461 CC   63.1 bhp    5.0        NaN   3.50
...       ...        ...    ...        ...    ...
5842  1248 CC     74 bhp    5.0  7.88 Lakh   4.75
5843  1120 CC     71 bhp    5.0        NaN   4.00
5844  2498 CC    112 bhp    8.0        NaN   2.90
5845   998 CC   67.1 bhp    5.0        NaN   2.65
5846   936 CC   57.6 bhp    5.0        NaN   2.50

[5847 rows x 14 columns]

==================================================

In [5]:
print("Missing values before handling:")
print(df.isnull().sum())
print("\n")

Missing values before handling:
Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [6]:
cols_with_missing = df.columns[df.isnull().any()].tolist()

for col in cols_with_missing:
    if col == 'New_Price':
        df[col].fillna(0, inplace=True)
        print(f"Replacing 0 price for missing values in New_Price")
    elif df[col].dtype == 'object':
        most_frequent = df[col].mode()[0]
        df[col].fillna(most_frequent, inplace=True)
        print(f"Populating missing values in '{col}' with mode: '{most_frequent}'")
    elif df[col].dtype in ['int64', 'float64']:
        median_value = df[col].median()
        df[col].fillna(median_value, inplace=True)
        print(f"Populating missing values in '{col}' with median: {median_value}")

print("\nMissing values after handling:")
print(df.isnull().sum())
print("\n" + "="*50 + "\n")

Imputed missing values in 'Mileage' with mode: '18.9 kmpl'
Imputed missing values in 'Engine' with mode: '1197 CC'
Imputed missing values in 'Power' with mode: '74 bhp'
Imputed missing values in 'Seats' with median: 5.0
Replacing 0 price for missing values in New_Price

Missing values after handling:
Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

==================================================

<ipython-input-6-d1666b7966ad>:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(most_frequent, inplace=True)
<ipython-input-6-d1666b7966ad>:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(median_value, inplace=True)
<ipython-input-6-d1666b7966ad>:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(0, inplace=True)

Reason for Missing Value Handling:
- Choosing to fill missing data rather than simply removing rows helps preserve a broader dataset, which is especially important if the dataset isn't exceptionally large. Deleting rows could lead to significant information loss and skew the analysis.
- For category-based features like 'Owner_Type' and 'Location', using the mode to replace missing values is logical. It substitutes with the most common category, which helps to maintain the original data distribution.
- When dealing with numerical features such as 'Mileage' or 'Price', the median is preferable to the mean because it's less sensitive to extreme values. This ensures that the replacement values are more representative.
- The decision to impute was made to maximize the data available for analysis. The method of imputation was tailored to each column's data type.

In [8]:
cols_to_clean = ['Mileage', 'Engine', 'Power', 'New_Price']
for col in cols_to_clean:
    if col in df.columns:
        df[col] = df[col].astype(str).str.extract(r'(\d+\.?\d*)').astype('float')
        print(f"Removed units from column '{col}'")

print("\nDataFrame after removing units:")
print(df)
print("\n" + "="*50 + "\n")

Removed units from column 'Mileage'
Removed units from column 'Engine'
Removed units from column 'Power'
Removed units from column 'New_Price'

DataFrame after removing units:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First    19.67  1582.0
1                 46000    Petrol       Manual      First    13.00  1199.0
2                 87000    Diesel       Manual      First    20.77  1248.0
3                 40670    Diesel    Automatic     Second    15.20  1968.0
4                 86999    Diesel       Manual      First    23.08  1461.0
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First    28.40  1248.0
5843             100000    Diesel       Manual      First    24.40  1120.0
5844              55000    Diesel       Manual     Second    14.00  2498.0
5845              46000    Petrol       Manual      First    18.90   998.0
5846              47000    Diesel       Manual      First    25.44   936.0

       Power  Seats  New_Price  Price
0     126.20    5.0       0.00  12.50
1      88.70    5.0       8.61   4.50
2      88.76    7.0       0.00   6.00
3     140.80    5.0       0.00  17.74
4      63.10    5.0       0.00   3.50
...      ...    ...        ...    ...
5842   74.00    5.0       7.88   4.75
5843   71.00    5.0       0.00   4.00
5844  112.00    8.0       0.00   2.90
5845   67.10    5.0       0.00   2.65
5846   57.60    5.0       0.00   2.50

[5847 rows x 14 columns]

==================================================

In [9]:
categorical_cols = ['Fuel_Type', 'Transmission']

df = pd.get_dummies(df, columns=categorical_cols, drop_first=True)
print("DataFrame after one-hot encoding:")
print(df)
print("\n" + "="*50 + "\n")

DataFrame after one-hot encoding:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0                 41000      First    19.67  1582.0  126.20    5.0       0.00
1                 46000      First    13.00  1199.0   88.70    5.0       8.61
2                 87000      First    20.77  1248.0   88.76    7.0       0.00
3                 40670     Second    15.20  1968.0  140.80    5.0       0.00
4                 86999      First    23.08  1461.0   63.10    5.0       0.00
...                 ...        ...      ...     ...     ...    ...        ...
5842              27365      First    28.40  1248.0   74.00    5.0       7.88
5843             100000      First    24.40  1120.0   71.00    5.0       0.00
5844              55000     Second    14.00  2498.0  112.00    8.0       0.00
5845              46000      First    18.90   998.0   67.10    5.0       0.00
5846              47000      First    25.44   936.0   57.60    5.0       0.00

      Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual
0     12.50               False             False                 True
1      4.50               False              True                 True
2      6.00               False             False                 True
3     17.74               False             False                False
4      3.50               False             False                 True
...     ...                 ...               ...                  ...
5842   4.75               False             False                 True
5843   4.00               False             False                 True
5844   2.90               False             False                 True
5845   2.65               False              True                 True
5846   2.50               False             False                 True

[5847 rows x 15 columns]

==================================================

In [10]:
current_year = 2025
df['Car_Age'] = current_year - df['Year']
print("DataFrame with 'Car_Age' feature:")
print(df)
print("\n" + "="*50 + "\n")

DataFrame with 'Car_Age' feature:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0                 41000      First    19.67  1582.0  126.20    5.0       0.00
1                 46000      First    13.00  1199.0   88.70    5.0       8.61
2                 87000      First    20.77  1248.0   88.76    7.0       0.00
3                 40670     Second    15.20  1968.0  140.80    5.0       0.00
4                 86999      First    23.08  1461.0   63.10    5.0       0.00
...                 ...        ...      ...     ...     ...    ...        ...
5842              27365      First    28.40  1248.0   74.00    5.0       7.88
5843             100000      First    24.40  1120.0   71.00    5.0       0.00
5844              55000     Second    14.00  2498.0  112.00    8.0       0.00
5845              46000      First    18.90   998.0   67.10    5.0       0.00
5846              47000      First    25.44   936.0   57.60    5.0       0.00

      Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  \
0     12.50               False             False                 True
1      4.50               False              True                 True
2      6.00               False             False                 True
3     17.74               False             False                False
4      3.50               False             False                 True
...     ...                 ...               ...                  ...
5842   4.75               False             False                 True
5843   4.00               False             False                 True
5844   2.90               False             False                 True
5845   2.65               False              True                 True
5846   2.50               False             False                 True

      Car_Age
0          10
1          14
2          13
3          12
4          12
...       ...
5842       11
5843       10
5844       13
5845       12
5846       14

[5847 rows x 16 columns]

==================================================

In [12]:
selected_cols_df = df[['Name', 'Location', 'Car_Age', 'Kilometers_Driven', 'Price']]
print("SELECT operation (selected columns):")
print(selected_cols_df)
print("\n")

filtered_df = df[df['Fuel_Type_Petrol'] == 1]
print("FILTER operation (Petrol cars):")
print(filtered_df)
print("\n")

renamed_df = df.rename(columns={'Kilometers_Driven': 'Driven_Kms', 'Car_Age': 'Age_in_Years'})
print("RENAME operation (renamed columns):")
print(renamed_df.head())
print("\n")

SELECT operation (selected columns):
                                  Name    Location  Car_Age  \
0     Hyundai Creta 1.6 CRDi SX Option        Pune       10
1                         Honda Jazz V     Chennai       14
2                    Maruti Ertiga VDI     Chennai       13
3      Audi A4 New 2.0 TDI Multitronic  Coimbatore       12
4               Nissan Micra Diesel XV      Jaipur       12
...                                ...         ...      ...
5842                  Maruti Swift VDI       Delhi       11
5843          Hyundai Xcent 1.1 CRDi S      Jaipur       10
5844             Mahindra Xylo D4 BSIV      Jaipur       13
5845                Maruti Wagon R VXI     Kolkata       12
5846             Chevrolet Beat Diesel   Hyderabad       14

      Kilometers_Driven  Price
0                 41000  12.50
1                 46000   4.50
2                 87000   6.00
3                 40670  17.74
4                 86999   3.50
...                 ...    ...
5842              27365   4.75
5843             100000   4.00
5844              55000   2.90
5845              46000   2.65
5846              47000   2.50

[5847 rows x 5 columns]


FILTER operation (Petrol cars):
      Unnamed: 0                                  Name    Location  Year  \
1              2                          Honda Jazz V     Chennai  2011
8             10                      Maruti Ciaz Zeta       Kochi  2018
9             11           Honda City 1.5 V AT Sunroof     Kolkata  2012
20            22  Audi A6 2011-2015 35 TFSI Technology      Mumbai  2015
21            23                 Hyundai i20 1.2 Magna     Kolkata  2010
...          ...                                   ...         ...   ...
5832        6004                      Hyundai Getz GLE  Coimbatore  2007
5837        6009                   Toyota Camry Hybrid      Mumbai  2015
5838        6010                  Honda Brio 1.2 VX MT       Delhi  2013
5839        6011               Skoda Superb 3.6 V6 FSI   Hyderabad  2009
5845        6017                    Maruti Wagon R VXI     Kolkata  2013

      Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
1                 46000      First    13.00  1199.0   88.70    5.0       8.61
8                 25692      First    21.56  1462.0  103.25    5.0      10.65
9                 60000      First    16.80  1497.0  116.30    5.0       0.00
20                55985      First    13.53  1984.0  177.01    5.0       0.00
21                45807      First    18.50  1197.0   80.00    5.0       0.00
...                 ...        ...      ...     ...     ...    ...        ...
5832              66800      First    15.30  1341.0   83.00    5.0       0.00
5837              33500      First    19.16  2494.0  158.20    5.0       0.00
5838              33746      First    18.50  1198.0   86.80    5.0       6.63
5839              53000      First     0.00  3597.0  262.60    5.0       0.00
5845              46000      First    18.90   998.0   67.10    5.0       0.00

      Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  \
1      4.50               False              True                 True
8      9.95               False              True                 True
9      4.49               False              True                False
20    23.50               False              True                False
21     1.87               False              True                 True
...     ...                 ...               ...                  ...
5832   2.20               False              True                 True
5837  19.75               False              True                False
5838   3.20               False              True                 True
5839   4.75               False              True                False
5845   2.65               False              True                 True

      Car_Age
1          14
8           7
9          13
20         10
21         15
...       ...
5832       18
5837       10
5838       12
5839       16
5845       12

[2684 rows x 16 columns]


RENAME operation (renamed columns):
   Unnamed: 0                              Name    Location  Year  Driven_Kms  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015       41000
1           2                      Honda Jazz V     Chennai  2011       46000
2           3                 Maruti Ertiga VDI     Chennai  2012       87000
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013       40670
4           6            Nissan Micra Diesel XV      Jaipur  2013       86999

  Owner_Type  Mileage  Engine   Power  Seats  New_Price  Price  \
0      First    19.67  1582.0  126.20    5.0       0.00  12.50
1      First    13.00  1199.0   88.70    5.0       8.61   4.50
2      First    20.77  1248.0   88.76    7.0       0.00   6.00
3     Second    15.20  1968.0  140.80    5.0       0.00  17.74
4      First    23.08  1461.0   63.10    5.0       0.00   3.50

   Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  Age_in_Years
0               False             False                 True            10
1               False              True                 True            14
2               False             False                 True            13
3               False             False                False            12
4               False             False                 True            12

In [15]:
df['Price_Per_KM'] = df['Price'] / (df['Kilometers_Driven'] + 1e-6) # Adding a small epsilon to avoid division by zero
print("MUTATE operation (added 'Price_Per_KM'):")
print(df[['Name', 'Price', 'Kilometers_Driven', 'Price_Per_KM']].head())
print("\n")

arranged_df = df.sort_values(by='Car_Age', ascending=False)
print("ARRANGE operation (sorted by 'Car_Age' descending):")
print(arranged_df[['Name', 'Car_Age']].head())
print("\n")

grouped_df = df.groupby('Fuel_Type_Petrol')['Price'].agg(['mean', 'median', 'count']).reset_index()
grouped_df['Fuel_Type'] = grouped_df['Fuel_Type_Petrol'].apply(lambda x: 'Petrol' if x == 1 else 'Diesel')
print("SUMMARIZE with GROUP BY ('Fuel_Type'):")
print(grouped_df[['Fuel_Type', 'mean', 'median', 'count']])

MUTATE operation (added 'Price_Per_KM'):
                               Name  Price  Kilometers_Driven  Price_Per_KM
0  Hyundai Creta 1.6 CRDi SX Option  12.50              41000      0.000305
1                      Honda Jazz V   4.50              46000      0.000098
2                 Maruti Ertiga VDI   6.00              87000      0.000069
3   Audi A4 New 2.0 TDI Multitronic  17.74              40670      0.000436
4            Nissan Micra Diesel XV   3.50              86999      0.000040


ARRANGE operation (sorted by 'Car_Age' descending):
                                   Name  Car_Age
3630  Mercedes-Benz E-Class 250 D W 210       27
5558                      Maruti Zen LX       27
3039                     Maruti Zen LXI       27
1791                 Honda City 1.3 EXI       26
1185                      Maruti Zen VX       26


SUMMARIZE with GROUP BY ('Fuel_Type'):
  Fuel_Type       mean  median  count
0    Diesel  12.960632   7.850   3163
1    Petrol   5.756688   4.205   2684